XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
/*
 * stm32f1_can.c
 *
 *  Created on: Oct 10, 2024
 *      Author: ADMIN
 */

#include "stm32f1_can.h"
#include <stddef.h>

static void CAN_PeriClockControl(CAN_RegDef_t *pCANx, uint8_t State)
{
  if(State == ENABLE)
  {
    if(pCANx == CAN1)
    {
      CAN1_PCLK_EN();
    }
    else
    {
      CAN2_PCLK_EN();
    }
  }
  else
  {
    if(pCANx == CAN1)
    {
      CAN1_PCLK_DI();
    }
    else
    {
      CAN2_PCLK_DI();
    }    
  }
}

uint8_t CAN_Init(CAN_Handle_t *pCANHandle)
{
  CAN_PeriClockControl(pCANHandle->pCANx, ENABLE);

  pCANHandle->RxFifo1MsgPendingCallback   = CAN_RxFifo1MsgPendingCallback;
  pCANHandle->RxFifo0FullCallback         = CAN_RxFifo0FullCallback;
  pCANHandle->RxFifo1MsgPendingCallback   = CAN_RxFifo1MsgPendingCallback;
  pCANHandle->RxFifo1FullCallback         = CAN_RxFifo1FullCallback;
  pCANHandle->TxMailbox0CompleteCallback  = CAN_TxMailbox0CompleteCallback;
  pCANHandle->TxMailbox1CompleteCallback  = CAN_TxMailbox1CompleteCallback;
  pCANHandle->TxMailbox2CompleteCallback  = CAN_TxMailbox2CompleteCallback;
  pCANHandle->TxMailbox0AbortCallback     = CAN_TxMailbox0AbortCallback;
  pCANHandle->TxMailbox1AbortCallback     = CAN_TxMailbox1AbortCallback;
  pCANHandle->TxMailbox2AbortCallback     = CAN_TxMailbox2AbortCallback;
  pCANHandle->SleepCallback               = CAN_SleepCallback;
  pCANHandle->WakeUpFromRxMsgCallback     = CAN_WakeUpFromRxMsgCallback;
  pCANHandle->ErrorCallback               = CAN_ErrorCallback;

  /* Request initalization */
  pCANHandle->pCANx->MCR |= (0x1UL << CAN_MCR_INRQ);

  /* Exit from sleep mode */
  pCANHandle->pCANx->MCR &= ~(0x1UL << CAN_MCR_SLEEP);

  /* Check exit from sleep mode */
  if(pCANHandle->pCANx->MSR & CAN_MSR_SLAK != 0U)
  {
    /* Update Error Code */
    pCANHandle->ErrorCode |= CAN_ERROR_TIMEOUT;

    /* Change CAN state */
    pCANHandle->State = CAN_STATE_ERROR;

    return 0;
  }

  /* Set time triggered communication mode */
  if(pCANHandle->CAN_Config.TimeTriggeredMode == ENABLE)
  {
    pCANHandle->pCANx->MCR |= CAN_MCR_TTCM;
  }
  else
  {
    pCANHandle->pCANx->MCR &= ~CAN_MCR_TTCM;   
  }

  /* Set automatic bus off management */
  if(pCANHandle->CAN_Config.AutoBusOff == ENABLE)
  {
    pCANHandle->pCANx->MCR |= CAN_MCR_ABOM;
  }
  else
  {
    pCANHandle->pCANx->MCR &= ~CAN_MCR_ABOM;
  }

  /* Set automatic retransmisstion */
  if(pCANHandle->CAN_Config.AutoRetransmission == ENABLE)
  {
    pCANHandle->pCANx->MCR |= CAN_MCR_NART;
  }
  else
  {
    pCANHandle->pCANx->MCR &= ~CAN_MCR_NART;
  }

  /* Set receive FIFO locked mode */
  if(pCANHandle->CAN_Config.ReceiveFifoLocked == ENABLE)
  {
    pCANHandle->pCANx->MCR |= CAN_MCR_RFLM;
  }
  else
  {
    pCANHandle->pCANx->MCR &= ~CAN_MCR_RFLM;
  }

  /* Set transmit FIFO Priority */
  if(pCANHandle->CAN_Config.TransmissFifoPriority == ENABLE)
  {
    pCANHandle->pCANx->MCR |= CAN_MCR_TXFP;
  }
  else
  {
    pCANHandle->pCANx->MCR &= ~CAN_MCR_TXFP;
  }

  /* Set bit timing register */
  pCANHandle->pCANx->BTR = (uint32_t)(pCANHandle->CAN_Config.Mode | pCANHandle->CAN_Config.SyncJumpWidth | pCANHandle->CAN_Config.TimeSeg1
                                    | pCANHandle->CAN_Config.TimeSeg2 | (pCANHandle->CAN_Config.Prescaler - 1U));
  /* Set error code */
  pCANHandle->ErrorCode = CAN_ERROR_NONE;

  /* Set CAN state */
  pCANHandle->State = CAN_STATE_READY;

  return 1;
}

uint8_t CAN_DeInit(CAN_Handle_t *pCANHandle)
{
  /* Stop the CAN module */
  (void)CAN_Stop(pCANHandle);

  /* Reset the CAN peripheral */
  pCANHandle->pCANx->MCR |= CAN_MCR_RESET;

  /* Set error code */
  pCANHandle->ErrorCode = CAN_ERROR_NONE;

  /* Set CAN state */
  pCANHandle->State = CAN_STATE_RESET;

  return 1;
}

/* Start the CAN module */
uint8_t CAN_Start(CAN_Handle_t *pCANHandle)
{
  if(pCANHandle->State == CAN_STATE_READY)
  {
    /* Change CAN peripheral state */
    pCANHandle->State == CAN_STATE_LISTENING;

    /* Request leave initialisation */
    pCANHandle->pCANx->MCR &= ~(0x1UL << CAN_MCR_INRQ_Pos);

    /* Wait the acknowledge */

    uint16_t Timeout = 10000;
    while ((pCANHandle->pCANx->MSR & CAN_MSR_INAK) != 0U)
    {
      if(Timeout == 0)
      {
        /* Update error code */
        pCANHandle->ErrorCode |= CAN_ERROR_TIMEOUT;

        /* Change CAN state */
        pCANHandle->State = CAN_STATE_ERROR;

        return 0;
      }
      Timeout --;
    }

    /* Reset the CAN ErrorCode */
    pCANHandle->ErrorCode = CAN_ERROR_NONE;

    return 1;
  }
  else
  {
    /* Update error code */
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_READY;

    return 0;
  }
}

/* Stop the CAN module and enable access to configuration registers */
uint8_t CAN_Stop(CAN_Handle_t *pCANHandle)
{
  if(pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Request initalization */
    pCANHandle->pCANx->MCR |= (0x1UL << CAN_MCR_INRQ);

    /* Wait the acknowledge */
    if((pCANHandle->pCANx->MSR & CAN_MSR_INAK) == 0U)
    {
      /* Update Error Code */
      pCANHandle->ErrorCode |= CAN_ERROR_TIMEOUT;

      /* Change CAN state */
      pCANHandle->State = CAN_STATE_ERROR;

      return 0;
    }

    /* Exit from sleep mode */
    pCANHandle->pCANx->MCR &= ~(0x1UL << CAN_MCR_SLEEP);

    /* Change CAN peripheral state*/
    pCANHandle->State = CAN_STATE_READY;

    return 1;
  }
  else
  {
    /* Update error code */
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_STARTED;

    return 0;
  }
}

uint8_t CAN_RegisterCallback(CAN_Handle_t *pCANHandle, CAN_CallbackID_t CallbackID, void (* pCallback)(CAN_Handle_t *pCANHandle))
{
  uint8_t Status = 1;
  if( pCANHandle->State == CAN_STATE_READY)
  {
    if(CallbackID == CAN_TX_MAILBOX0_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox0CompleteCallback = pCallback;
    }
    else if (CallbackID == CAN_TX_MAILBOX1_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox1CompleteCallback = pCallback;
    }
    else if (CallbackID == CAN_TX_MAILBOX2_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox2CompleteCallback = pCallback;
    }
    else if (CallbackID == CAN_TX_MAILBOX0_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox0AbortCallback = pCallback;
    }
    else if (CallbackID == CAN_TX_MAILBOX1_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox1AbortCallback = pCallback;
    }
    else if (CallbackID == CAN_TX_MAILBOX2_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox2AbortCallback = pCallback;
    }
    else if (CallbackID == CAN_RX_FIFO0_MSG_PENDING_CB_ID)
    {
      pCANHandle->RxFifo0MsgPendingCallback = pCallback;
    }
    else if (CallbackID == CAN_RX_FIFO1_MSG_PENDING_CB_ID)
    {
      pCANHandle->RxFifo1MsgPendingCallback = pCallback;
    }
    else if (CallbackID == CAN_RX_FIFO0_FULL_CB_ID)
    {
      pCANHandle->RxFifo0FullCallback = pCallback;
    }
    else if (CallbackID == CAN_RX_FIFO1_FULL_CB_ID)
    {
      pCANHandle->RxFifo1FullCallback = pCallback;
    }
    else if (CallbackID == CAN_SLEEP_CB_ID)
    {
      pCANHandle->SleepCallback = pCallback;
    }
    else if (CallbackID == CAN_WAKEUP_FROM_RX_MSG_CB_ID)
    {
      pCANHandle->WakeUpFromRxMsgCallback = pCallback;
    }
    else if (CallbackID == CAN_ERROR_CB_ID)
    {
      pCANHandle->ErrorCallback = pCallback;
    }
  }
  else
  {
    Status = 0;
  }

