XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
  return Status;
}

uint8_t CAN_UnRegisterCallback(CAN_Handle_t *pCANHandle, CAN_CallbackID_t CallbackID)
{
  uint8_t Status = 1;
  if( pCANHandle->State == CAN_STATE_READY)
  {
    if(CallbackID == CAN_TX_MAILBOX0_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox0CompleteCallback = NULL;
    }
    else if (CallbackID == CAN_TX_MAILBOX1_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox1CompleteCallback = NULL;
    }
    else if (CallbackID == CAN_TX_MAILBOX2_COMPLETE_CB_ID)
    {
      pCANHandle->TxMailbox2CompleteCallback = NULL;
    }
    else if (CallbackID == CAN_TX_MAILBOX0_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox0AbortCallback = NULL;
    }
    else if (CallbackID == CAN_TX_MAILBOX1_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox1AbortCallback = NULL;
    }
    else if (CallbackID == CAN_TX_MAILBOX2_ABORT_CB_ID)
    {
      pCANHandle->TxMailbox2AbortCallback = NULL;
    }
    else if (CallbackID == CAN_RX_FIFO0_MSG_PENDING_CB_ID)
    {
      pCANHandle->RxFifo0MsgPendingCallback = NULL;
    }
    else if (CallbackID == CAN_RX_FIFO1_MSG_PENDING_CB_ID)
    {
      pCANHandle->RxFifo1MsgPendingCallback = NULL;
    }
    else if (CallbackID == CAN_RX_FIFO0_FULL_CB_ID)
    {
      pCANHandle->RxFifo0FullCallback = NULL;
    }
    else if (CallbackID == CAN_RX_FIFO1_FULL_CB_ID)
    {
      pCANHandle->RxFifo1FullCallback = NULL;
    }
    else if (CallbackID == CAN_SLEEP_CB_ID)
    {
      pCANHandle->SleepCallback = NULL;
    }
    else if (CallbackID == CAN_WAKEUP_FROM_RX_MSG_CB_ID)
    {
      pCANHandle->WakeUpFromRxMsgCallback = NULL;
    }
    else if (CallbackID == CAN_ERROR_CB_ID)
    {
      pCANHandle->ErrorCallback = NULL;
    }
  }
  else
  {
    Status = 0;
  }

  return Status;  
}

uint8_t CAN_ConfigFilter(CAN_Handle_t *pCANHandle, CAN_Filter_t *sFilterConfig)
{
  uint32_t FilterPos;
  CAN_RegDef_t *CAN_Ip = pCANHandle->pCANx;

  /* Initialisation mode for filter bank */
  pCANHandle->pCANx->FMR |= CAN_FMR_FINIT;

  if(pCANHandle->pCANx == CAN2)
  {
    /* Select the start filter number of CAN2 slave */
    /* When CAN2SB[5:0] is set to 0, no filters are assigned to CAN1 */
    pCANHandle->pCANx->FMR &= ~CAN_FMR_CAN2SB;
    /* What number bank filter CAN2 use */
    pCANHandle->pCANx->FMR |= (sFilterConfig->SlaveStartFilterBank << CAN_FMR_CAN2SB_Pos);
  }

  /* Convert filter number into bit position */
  /* Filter bank 0 - 27 */
  FilterPos = (uint32_t)1 << (sFilterConfig->FilterBank & 0x1FU);
  /* Filter Deactivation */
  pCANHandle->pCANx->FA1R &= ~(FilterPos);

  /* Filter Scale */
  if(sFilterConfig->FilterScale == CAN_FILTERSCALE_16BIT)
  {
    /* 16-bit scale for the filter */
    CAN_Ip->FS1R &= ~(FilterPos);
    /* First 16-bit identifier and First 16-bit mask */
    /* Or First 16-bit identifier and Second 16-bit identifier */
    CAN_Ip->sFilterRegister[sFilterConfig->FilterBank].FR1 = ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIDLow << 16U) |
                                                              (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIDLow));

    /* Second 16-bit identifier and Second 16-bit mask */
    /* Or Third 16-bit identifier and Fourth 16-bit identifier */
    CAN_Ip->sFilterRegister[sFilterConfig->FilterBank].FR2 = ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIDHigh << 16U) |
                                                              (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIDHigh));
  }

  if(sFilterConfig->FilterScale == CAN_FILTERSCALE_32BIT)
  {
    /* 32-bit scale for the filter */ 
    CAN_Ip->FS1R |= (FilterPos);
    /* 32-bit identifier or First 32-bit identifier */
    CAN_Ip->sFilterRegister[sFilterConfig->FilterBank].FR1 = ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterIDHigh << 16U) |
                                                              (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIDLow));

    /* 32-bit mask or Second 32-bit identifier */ 
    CAN_Ip->sFilterRegister[sFilterConfig->FilterBank].FR1 = ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIDHigh << 16U) |
                                                              (0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIDLow));  
  }

  /* Filter Mode */
  if(sFilterConfig->FilterMode == CAN_FILTERMODE_IDMASK)
  {
    /* Id/Mask mode for the filter*/
    CAN_Ip->FM1R &= ~(FilterPos);
  }
  else /* CAN_FilterInitStruct->CAN_FilterMode == CAN_FILTERMODE_IDLIST */
  {
    /* Identifier list mode for the filter*/
    CAN_Ip->FM1R |= (FilterPos);
  }

  /* Filter FIFO assignment */
  if(sFilterConfig->FilterFIFONumber == CAN_FILTER_FIFO0)
  {
    /* FIFO 0 assignation for the filter */
    CAN_Ip->FFA1R &= ~(FilterPos);
  }
  else
  {
    /* FIFO 1 assignation for the filter */
    CAN_Ip->FFA1R |= (FilterPos);     
  }

  /* Filter activation */
  if(sFilterConfig->FilterActivation == CAN_FILTER_ENABLE)
  {
    CAN_Ip->FA1R |= FilterPos;
  }

  /* Leave the initialisation mode for the filter */
  CAN_Ip->FFA1R &= ~CAN_FMR_FINIT;

  /* Return function status */
  return 1;

}

/* Request the sleep mode (low power) entry */
uint8_t CAN_RequestSleep(CAN_Handle_t *pCANHandle)
{
  uint8_t State = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Request Sleep Mode */
    pCANHandle->pCANx->MCR |= CAN_MCR_SLEEP;

    State = 1;
  }
  else
  {
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;

    State = 0;
  } 

  return State;
}
uint8_t CAN_WakeUpFromSleep(CAN_Handle_t *pCANHandle)
{
  uint8_t State = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Request Wakeup Mode */
    pCANHandle->pCANx->MCR |= CAN_MCR_SLEEP;
    /* Wait sleep mode is exited */
    for (uint16_t i = 0; i < 10000; i++)
    {
      State = 1;
    }
  }
  else
  {
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;

    State = 0;
  } 

  return State; 
}

/* Add message vào Tx mailbox đầu tiên và active yêu cầu tương ứng */
/* pTxMailbox: CAN Tx MailBox */
uint8_t CAN_AddTxMessageToMailBox(CAN_Handle_t *pCANHandle, CAN_TxHeader_t *pHeader, uint8_t aData[], uint32_t *pTxMailbox)
{
  uint32_t TSR_Register = pCANHandle->pCANx->TSR;
  uint32_t TransmitMailbox;
  uint8_t Status = 0;

