XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Check that all the Tx mailboxes are not full */
    if(((TSR_Register & CAN_TSR_TME0) != 0) || 
       ((TSR_Register & CAN_TSR_TME1) != 0) || 
       ((TSR_Register & CAN_TSR_TME2) != 0))
    {
      /* Select an empty transmit mailbox */
      TransmitMailbox = (TSR_Register & CAN_TSR_CODE) >> CAN_TSR_CODE_Pos;
      
      /* Check transmit mailbox value */
      if(TransmitMailbox > 2U)
      {
        /* Update error code */
        pCANHandle->ErrorCode |= CAN_ERROR_INTERNAL;
        return 0;
      }

      /* Store the Tx mailbox */
      *pTxMailbox = (uint32_t)1 << TransmitMailbox;

      /* Set up the Id */
      /* CAN TX mailbox identifier register (CAN_TIxR) (x=0..2) */
      if(pHeader->IDE == CAN_ID_STD)
      {
        pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TIR = ((pHeader->StdId << CAN_TI0R_STID_Pos) 
                                                             | pHeader->RTR);
      }
      else
      {
        pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TIR = ((pHeader->ExtId << CAN_TI0R_EXID_Pos)
                                                             | pHeader->IDE
                                                             | pHeader->RTR);                                                   
      }

      /* Set up DLC */
      pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TDTR = (pHeader->DLC);

      /* Set up Transmit Global Time mode */
      /* CAN mailbox data length control and time stamp register (CAN_TDTxR) (x=0..2) */
      /* TGT: Transmit global time */
      if(pHeader->TransmissGlobalTime == ENABLE)
      {
        pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TDTR |= CAN_TDT0R_TGT;
      }

      /* Set up trường data */
      /* CAN mailbox data high register (CAN_TDHxR) (x=0..2) */
      pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TDHR = ((uint32_t)aData[7] << CAN_TDH0R_DATA7_Pos) | \
                                                            ((uint32_t)aData[6] << CAN_TDH0R_DATA6_Pos) | \
                                                            ((uint32_t)aData[5] << CAN_TDH0R_DATA5_Pos) | \
                                                            ((uint32_t)aData[4] << CAN_TDH0R_DATA4_Pos);
      /* CAN mailbox data low register (CAN_TDLxR) (x=0..2) */
      pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TDLR = ((uint32_t)aData[3] << CAN_TDL0R_DATA3_Pos) | \
                                                            ((uint32_t)aData[2] << CAN_TDL0R_DATA2_Pos) | \
                                                            ((uint32_t)aData[1] << CAN_TDL0R_DATA1_Pos) | \
                                                            ((uint32_t)aData[0] << CAN_TDL0R_DATA0_Pos);
      /* Request transmisstion */
      /* CAN TX mailbox identifier register (CAN_TIxR) (x=0..2) */
      /* TXRQ: Transmit mailbox request */
      pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TIR |= CAN_TI0R_TXRQ;
      Status = 1;   
    }
    else
    {
      pCANHandle->ErrorCode |= CAN_ERROR_PARAM;
      Status = 0;
    }
  }
  else
  {
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;
    Status = 0;
  }
  return Status;
}
uint8_t CAN_AbortTxRequest(CAN_Handle_t *pCANHandle, uint32_t TxMailboxes)
{
  /* TSR: CAN transmit status register (CAN_TSR) */
  uint8_t Status = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* ABRQx: Abort request for mailbox x */  /* x = 0, 1, 2*/
    /* Check Tx Mailbox 0 */
    if((TxMailboxes & CAN_TX_MAILBOX0) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 0 */
      pCANHandle->pCANx->TSR |= CAN_TSR_ABRQ0;
    }

    /* Check Tx Mailbox 1 */
    if((TxMailboxes & CAN_TX_MAILBOX1) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 1 */
      pCANHandle->pCANx->TSR |= CAN_TSR_ABRQ1;
    }

    /* Check Tx Mailbox 2 */
    if((TxMailboxes & CAN_TX_MAILBOX2) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 2 */
      pCANHandle->pCANx->TSR |= CAN_TSR_ABRQ2;
    }

    Status = 1;
  }
  else
  {
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;
    Status = 0;
  }
  return Status;
}

uint32_t CAN_GetNumberTxMailboxFree(CAN_Handle_t *pCANHandle)
{
  /* TSR: CAN transmit status register (CAN_TSR) */
  uint32_t FreeNumber = 0U;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* TMEx: Transmit mailbox x empty */    /* x = 0, 1, 2*/
    /* Check Tx Mailbox 0 status */
    if(pCANHandle->pCANx->TSR & CAN_TSR_TME0 != 0)
    {
      FreeNumber++;
    }

    /* Check Tx Mailbox 1 status */
    if(pCANHandle->pCANx->TSR & CAN_TSR_TME1 != 0)
    {
      FreeNumber++;
    }

    /* Check Tx Mailbox 2 status */
    if(pCANHandle->pCANx->TSR & CAN_TSR_TME2 != 0)
    {
      FreeNumber++;
    }
  }
  return FreeNumber;
}

uint32_t CAN_IsTxMessageMailboxPending(CAN_Handle_t *pCANHandle, uint32_t TxMailboxes)
{
  uint8_t Status = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Check pending transmission request on the selected Tx Mailboxes */
    if((pCANHandle->pCANx->TSR & (TxMailboxes << CAN_TSR_TME0_Pos)) != (TxMailboxes << CAN_TSR_TME0_Pos))
    {
      Status = 1U;
    }
  }  
  return Status; 
}
/* Đảo ngược thứ tự bit của giá trị đã cho */
//__STATIC_FORCEINLINE 
uint32_t Revert_Bits(uint32_t Value)
{
  uint32_t Result;
  uint32_t Number_Bit = 31;
  Result = Value;

  for(Value = Value >> 1U; Value != 0U; Value = Value >> 1U)
  {
    Result = Result << 1U;
    Result |= Value & 1U;
    Number_Bit--;
  }
  Result = Result << Number_Bit;

  return Result;
}

/* Return timestamp of Tx message đã gửi, if the time trigger communication mode is enabled */
uint32_t CAN_GetTxTimestamp(CAN_Handle_t *pCANHandle, uint32_t TxMailbox)
{
  uint32_t TimesTamp = 0U;
  uint32_t TransmitMailbox;

  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    TransmitMailbox = (uint8_t)__builtin_clz(Revert_Bits(TxMailbox));

