XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
    /* Get timestamp */
    TimesTamp = (pCANHandle->pCANx->sTxMailBox[TransmitMailbox].TDTR & CAN_TDT0R_TIME) >> CAN_TDT0R_TIME_Pos;
  }
  return TimesTamp;
}
uint8_t  CAN_GetRxMessage(CAN_Handle_t *pCANHandle, uint32_t RxFifo, CAN_RxHeader_t *pHeader, uint8_t aData[])
{
  uint8_t Status = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Check the RX FIFO */
    if(RxFifo == CAN_RX_FIFO0)  
    {
      /* Check Rx FIFO không empty */
      if((pCANHandle->pCANx->RF0R & CAN_RF0R_FMP0) == 0U) 
      {
        /* Update error code */
        pCANHandle->ErrorCode |= CAN_ERROR_PARAM;
        return 0;
      }    
    }
    else
    {
      /* Check Rx FIF1 không empty */
      if((pCANHandle->pCANx->RF1R & CAN_RF1R_FMP1) == 0U) 
      {
        /* Update error code */
        pCANHandle->ErrorCode |= CAN_ERROR_PARAM;
        return 0;
      }       
    }

    /* Get header */
    pHeader->IDE = CAN_RI0R_IDE & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RIR;

    if(pHeader->IDE == CAN_ID_STD)
    {
      pHeader->StdId = (CAN_RI0R_STID & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RIR) >> CAN_TI0R_STID_Pos;
    }
    else
    {
      pHeader->ExtId = ((CAN_RI0R_EXID | CAN_RI0R_STID) & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RIR) >> CAN_TI0R_EXID_Pos;
    }

    pHeader->RTR              = (CAN_RI0R_RTR   & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RIR); 
    pHeader->DLC              = (CAN_RDT0R_DLC  & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDTR) >> CAN_RDT0R_DLC_Pos;
    pHeader->FilterMatchIndex = (CAN_RDT0R_FMI  & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDTR) >> CAN_RDT0R_FMI_Pos;
    pHeader->TimeStamp        = (CAN_RDT0R_TIME & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDTR) >> CAN_RDT0R_TIME_Pos;

    /* Get data */
    aData[0] = (uint8_t)((CAN_RDL0R_DATA0 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDL0R_DATA0_Pos); 
    aData[1] = (uint8_t)((CAN_RDL0R_DATA1 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDL0R_DATA1_Pos); 
    aData[2] = (uint8_t)((CAN_RDL0R_DATA2 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDL0R_DATA2_Pos); 
    aData[3] = (uint8_t)((CAN_RDL0R_DATA3 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDL0R_DATA3_Pos); 
    aData[4] = (uint8_t)((CAN_RDH0R_DATA4 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDH0R_DATA4_Pos); 
    aData[5] = (uint8_t)((CAN_RDH0R_DATA5 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDH0R_DATA5_Pos); 
    aData[6] = (uint8_t)((CAN_RDH0R_DATA6 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDH0R_DATA6_Pos);
    aData[7] = (uint8_t)((CAN_RDH0R_DATA7 & pCANHandle->pCANx->sFIFOMailBox[RxFifo].RDLR) >> CAN_RDH0R_DATA7_Pos); 

    /* Release FIFO */
    if(RxFifo == CAN_RX_FIFO0)
    {
      /* Release FIFO 0 */
      pCANHandle->pCANx->RF0R |= CAN_RF0R_RFOM0;
    } 
    else
    {
      /* Release FIFO 1 */
      pCANHandle->pCANx->RF1R |= CAN_RF1R_RFOM1;
    }

    /* Return function status */
    Status = 1;
  }
  else
  {
    pCANHandle->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;
    Status = 0;
  }

  return Status;
}

/* Trả về số lượng message bị pending trong Received FIFOx */
/* RxFifo CAN Receive FIFO number */
uint32_t CAN_GetNumberRxPendingInFIFO(CAN_Handle_t *pCANHandle, uint32_t RxFifo)
{
  uint32_t FillLever = 0U;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    if(RxFifo == CAN_RX_FIFO0)
    {
      FillLever = pCANHandle->pCANx->RF0R & CAN_RF0R_FMP0;
    }
    else  //RxFifo == CAN_RX_FIFO1
    {
      FillLever = pCANHandle->pCANx->RF1R & CAN_RF1R_FMP1;
    }
  }
  /* Return Rx FIFO fill level */
  return FillLever;
}

uint8_t  CAN_EnableInterrupt(CAN_Handle_t *pCANHandle, uint32_t InterruptType)
{
  uint8_t Status = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Enable the selected interrupt */
    pCANHandle->pCANx->IER |= InterruptType;
    Status = 1;
  }
  else
  {
    Status = 0;
  }

  return Status;
}
uint8_t  CAN_DisableInterrupt(CAN_Handle_t *pCANHandle, uint32_t InterruptType)
{
  uint8_t Status = 0;
  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Disable the selected interrupt */
    pCANHandle->pCANx->IER &= ~InterruptType;
    Status = 1;
  }
  else
  {
    Status = 0;
  }

  return Status;
}

void CAN_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        if (IRQNumber <= 31) // 0 - 31
        {
            *NVIC_ISER0 |= (1 << IRQNumber);
        }
        else if (31 < IRQNumber && IRQNumber < 64) // 32 - 63
        {
            *NVIC_ISER1 |= (1 << (IRQNumber % 32));
        }
        else if (64 <= IRQNumber && IRQNumber < 96) // 64 - 95
        {
            *NVIC_ISER2 |= (1 << (IRQNumber % 64));
        }
    }
    else
    {
        if (IRQNumber <= 31) // 0 - 31
        {
            *NVIC_ICER0 |= (1 << IRQNumber);
        }
        else if (31 < IRQNumber && IRQNumber < 64) // 32 - 63
        {
            *NVIC_ICER1 |= (1 << (IRQNumber % 32));
        }
        else if (64 <= IRQNumber && IRQNumber < 96) // 64 - 95
        {
            *NVIC_ICER2 |= (1 << (IRQNumber % 64));
        }
    }
}
void CAN_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
    uint8_t ipr = IRQNumber / 4;
    uint8_t irq = IRQNumber % 4; 

    //*(NVIC_PR_BASEADDR + ipr) &= ~(0xF << (8 * irq + 4));

    *(NVIC_PR_BASEADDR + ipr) |= (IRQPriority << (8 * irq + 4));
}
void CAN_IRQHandling(CAN_Handle_t *pCANHandle)
{
  uint32_t ErrorCode = CAN_ERROR_NONE;
  uint32_t Interrupts = pCANHandle->pCANx->IER;
  uint32_t MSRflags  = pCANHandle->pCANx->MSR;
  uint32_t TSRflags  = pCANHandle->pCANx->TSR;
  uint32_t RF0R_flags = pCANHandle->pCANx->RF0R;
  uint32_t RF1R_flags = pCANHandle->pCANx->RF1R;
  uint32_t ESR_flags  = pCANHandle->pCANx->ESR;

  /* Transmit Mailbox empty interrupt */
  if((Interrupts & CAN_IT_TX_MAILBOX_EMPTY) != 0U)
  {
    /* Transmit Mailbox 0 */
    if((TSRflags & CAN_TSR_RQCP0) != 0U)
    {
      /* Clear the Transmission Complete flag */
      pCANHandle->pCANx->TSR = (1U << (CAN_FLAG_RQCP0 & 0x000000FFU));

