XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
      /* Transmit thành công */
      if((TSRflags & CAN_TSR_ABRQ0) != 0U)
      {
        /* Transmission Mailbox 0 complete callback */
        pCANHandle->TxMailbox0CompleteCallback(pCANHandle);
      }
      else
      {
        /* Arbitration lost for Mailbox0 */
        if((TSRflags & CAN_TSR_ALST0) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_ALST0;
        }
        /* Transmission error of Mailbox0 */
        else if ((TSRflags & CAN_TSR_TERR0) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_TERR0;
        }
        else
        {
          /* Transmission Mailbox 0 abort callback */
          pCANHandle->TxMailbox0AbortCallback(pCANHandle);
        }
      }
    }

    /* Transmit Mailbox 1 */
    if((TSRflags & CAN_TSR_RQCP1) != 0U)
    {
      /* Clear the Transmission Complete flag */
      pCANHandle->pCANx->TSR = (1U << (CAN_FLAG_RQCP1 & 0x000000FFU));

      /* Transmit thành công */
      if((TSRflags & CAN_TSR_ABRQ1) != 0U)
      {
        /* Transmission Mailbox 1 complete callback */
        pCANHandle->TxMailbox1CompleteCallback(pCANHandle);
      }
      else
      {
        /* Arbitration lost for Mailbox1 */
        if((TSRflags & CAN_TSR_ALST1) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_ALST1;
        }
        /* Transmission error of Mailbox1 */
        else if ((TSRflags & CAN_TSR_TERR1) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_TERR1;
        }
        else
        {
          /* Transmission Mailbox 1 abort callback */
          pCANHandle->TxMailbox1AbortCallback(pCANHandle);
        }
      }
    }

    /* Transmit Mailbox 2 */
    if((TSRflags & CAN_TSR_RQCP2) != 0U)
    {
      /* Clear the Transmission Complete flag */
      pCANHandle->pCANx->TSR = (1U << (CAN_FLAG_RQCP2 & 0x000000FFU));

      /* Transmit thành công */
      if((TSRflags & CAN_TSR_ABRQ2) != 0U)
      {
        /* Transmission Mailbox 2 complete callback */
        pCANHandle->TxMailbox2CompleteCallback(pCANHandle);
      }
      else
      {
        /* Arbitration lost for Mailbox2 */
        if((TSRflags & CAN_TSR_ALST2) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_ALST2;
        }
        /* Transmission error of Mailbox2 */
        else if ((TSRflags & CAN_TSR_TERR2) != 0U)
        {
          ErrorCode |= CAN_ERROR_TX_TERR2;
        }
        else
        {
          /* Transmission Mailbox 1 abort callback */
          pCANHandle->TxMailbox1AbortCallback(pCANHandle);
        }
      }
    }
  }

  /* Receive FIFO 0 overrun interrupt */
  if((Interrupts & CAN_IT_RX_FIFO0_OVERRUN) != 0U)
  {
    if((RF0R_flags & CAN_RF0R_FOVR0) != 0U)
    {
      /* Set CAN error code to Rx Fifo 0 overrun error */
      ErrorCode |= CAN_ERROR_RX_FOV0;

      /* Clear FIFO0 Overrun Flag */
      pCANHandle->pCANx->RF0R = (1U << (CAN_FLAG_FOV0 & 0x000000FFU));
    }
  }

  /* Receive FIFO 0 full interrupt */
  if((Interrupts & CAN_IT_RX_FIFO0_FULL) != 0U)
  {
    if((RF0R_flags & CAN_RF0R_FULL0) != 0U)
    {
      /* Clear FIFO0 full Flag */
      pCANHandle->pCANx->RF0R = (1U << (CAN_FLAG_FF0 & 0x000000FFU));

      /* Receive FIFO 0 full Callback */
      pCANHandle->RxFifo0FullCallback(pCANHandle);     
    }
  }

  /* Receive FIFO 0 message pending interrupt */
  if((Interrupts & CAN_IT_RX_FIFO0_MSG_PENDING) != 0U)
  {
    /* Check if message still pending */
    if((pCANHandle->pCANx->RF0R & CAN_RF0R_FMP0) != 0U)
    {
      /* Receive FIFO 0 message pending Callback */
      pCANHandle->RxFifo0MsgPendingCallback(pCANHandle);
    }
  }

/* Receive FIFO 1 overrun interrupt */
  if((Interrupts & CAN_IT_RX_FIFO1_OVERRUN) != 0U)
  {
    if((RF1R_flags & CAN_RF1R_FOVR1) != 0U)
    {
      /* Set CAN error code to Rx Fifo 1 overrun error */
      ErrorCode |= CAN_ERROR_RX_FOV1;

      /* Clear FIFO1 Overrun Flag */
      pCANHandle->pCANx->RF1R = (1U << (CAN_FLAG_FOV1 & 0x000000FFU));
    }
  }

  /* Receive FIFO 1 full interrupt */
  if((Interrupts & CAN_IT_RX_FIFO1_FULL) != 0U)
  {
    if((RF1R_flags & CAN_RF1R_FULL1) != 0U)
    {
      /* Clear FIFO1 full Flag */
      pCANHandle->pCANx->RF1R = (1U << (CAN_FLAG_FF1 & 0x000000FFU));

      /* Receive FIFO 1 full Callback */
      pCANHandle->RxFifo1FullCallback(pCANHandle);     
    }
  }

  /* Receive FIFO 1 message pending interrupt */
  if((Interrupts & CAN_IT_RX_FIFO1_MSG_PENDING) != 0U)
  {
    /* Check if message still pending */
    if((pCANHandle->pCANx->RF1R & CAN_RF1R_FMP1) != 0U)
    {
      /* Receive FIFO 1 message pending Callback */
      pCANHandle->RxFifo1MsgPendingCallback(pCANHandle);
    }
  }

  /* Sleep interrupt */
  if((Interrupts & CAN_IT_SLEEP_ACK) != 0U)
  {
    /* Check if message still pending */
    if((MSRflags & CAN_MSR_SLAKI) != 0U)
    {
      /* Clear Sleep interrupt Flag */
      pCANHandle->pCANx->MSR = (1U << (CAN_FLAG_SLAKI & 0x000000FFU));

      /* Sleep Callback */
      pCANHandle->SleepCallback(pCANHandle);
    }
  }

  /* Wakeup interrupt */
  if((Interrupts & CAN_IT_WAKEUP) != 0U)
  {
    /* Check if message still pending */
    if((MSRflags & CAN_MSR_WKUI) != 0U)
    {
      /* Clear Wakeup interrupt Flag */
      pCANHandle->pCANx->MSR = (1U << (CAN_FLAG_WKU & 0x000000FFU));

      /* Wakeup Callback */
      pCANHandle->WakeUpFromRxMsgCallback(pCANHandle);
    }
  }

  /* Error interrupts */
  if((Interrupts & CAN_IT_ERROR) != 0U)
  {
    if((MSRflags & CAN_MSR_ERRI) != 0U)
    {
      /* Check Error Warning Flag */
      if((((Interrupts & CAN_IT_ERROR_WARNING) != 0U) &&
         (ESR_flags & CAN_ESR_EWGF) != 0U));
      {
        /* Set CAN error code to Error Warning */
        ErrorCode |= CAN_ERROR_EWG;
      }

      /* Check Error Passive Flag */
      if((((Interrupts & CAN_IT_ERROR_PASSIVE) != 0U) &&
         (ESR_flags & CAN_ESR_EPVF) != 0U));
      {
        /* Set CAN error code to Error Passive */
        ErrorCode |= CAN_ERROR_EPV;
      }

      /* Check Bus-off Flag */
      if((((Interrupts & CAN_IT_BUSOFF) != 0U) &&
         (ESR_flags & CAN_ESR_BOFF) != 0U));
      {
        /* Set CAN error code to Bus-off */
        ErrorCode |= CAN_ERROR_BOF;
      }

      /* Check Last Error Code Flag */
      if((((Interrupts & CAN_IT_LAST_ERROR_CODE) != 0U) &&
         (ESR_flags & CAN_ESR_LEC) != 0U));
      {
        switch (ESR_flags & CAN_ESR_LEC)
        {
          case (CAN_ESR_LEC_0):
            /* Set CAN error code to Stuff error */
            ErrorCode |= CAN_ERROR_STF;
            break;
          case (CAN_ESR_LEC_1):
            /* Set CAN error code to Form error */
            ErrorCode |= CAN_ERROR_FOR;
            break;
          case (CAN_ESR_LEC_0 | CAN_ESR_LEC_1):
            /* Set CAN error code to Acknowledgement error */
            ErrorCode |= CAN_ERROR_ACK;
            break;
          case (CAN_ESR_LEC_2):
            /* Set CAN error code to Bit recessive error */
            ErrorCode |= CAN_ERROR_BR;
            break;
          case (CAN_ESR_LEC_2 | CAN_ESR_LEC_0):
            /* Set CAN error code to Bit Dominant error */
            ErrorCode |= CAN_ERROR_BD;
            break;  
          case (CAN_ESR_LEC_2 | CAN_ESR_LEC_1):
            /* Set CAN error code to CRC error */
            ErrorCode |= CAN_ERROR_CRC;
            break;       
          default:
            break;
        }

        /* Clear Last error code Flag */
        pCANHandle->pCANx->ESR &= ~CAN_ESR_LEC;
      }
    }
    /* Clear ERRI Flag */
    pCANHandle->pCANx->MSR = (1U << (CAN_FLAG_ERRI & 0x000000FFU));
  }

  /* Call the Error call Back in case of Errors */
  if(ErrorCode != CAN_ERROR_NONE)
  {
    /* Update error code in handle */
    pCANHandle->ErrorCode |= ErrorCode;

    /* Call Error callback function */
    pCANHandle->ErrorCallback(pCANHandle);
  }

