XuanThucNgo/Device_Driver_STM32F1xx/drivers/Src/stm32f1_can.c
}

uint8_t  CAN_GetState(CAN_Handle_t *pCANHandle)
{
  CAN_State_t State = pCANHandle->State;

  if(pCANHandle->State == CAN_STATE_READY || pCANHandle->State == CAN_STATE_LISTENING)
  {
    /* Check sleep mode acknowladge flag */
    if((pCANHandle->pCANx->MSR & CAN_MSR_SLAK) != 0U)
    {
      /* Sleep mode is active */
      State = CAN_STATE_SLEEP_ACTIVE;
    }
    /* Check sleep mode request flag */
    else if ((pCANHandle->pCANx->MCR & CAN_MCR_SLEEP) != 0U)
    {
      /* Sleep mode request is pending */
      State = CAN_STATE_SLEEP_PENDING;
    }
    else
    {
      /*KHONG CO GI*/
    }
  }

  /* Return CAN state */
  return State;
}
uint32_t CAN_GetError(CAN_Handle_t *pCANHandle)
{
  return pCANHandle->ErrorCode;
}

void CAN_TxMailbox0CompleteCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_TxMailbox1CompleteCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_TxMailbox2CompleteCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_TxMailbox0AbortCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_TxMailbox1AbortCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_TxMailbox2AbortCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_RxFifo0MsgPendingCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_RxFifo0FullCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_RxFifo1MsgPendingCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_RxFifo1FullCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_SleepCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_WakeUpFromRxMsgCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}
void CAN_ErrorCallback(CAN_Handle_t *pCANHandle)
{
  (void)pCANHandle;
}




